In [1]:
import numpy as np

In [3]:
import pandas as pd

In [5]:
from numpy.random import randn

In [7]:
pd.DataFrame(randn(5,4))

          0         1         2         3
0 -0.515007  0.454659  2.740278  1.817429
1  0.710757  0.399072 -1.024888 -1.702449
2 -0.551801  0.383831  0.754431 -0.774755
3 -0.117979 -0.493062  0.106152  1.232933
4  1.344607  0.954419  1.000857 -0.333746

In [11]:
df = pd.DataFrame(randn(5,4),index='a b c d e'.split(),columns='w x y z'.split())

In [12]:
df

          w         x         y         z
a -0.324626  0.346383  0.482216  0.693656
b  1.216777  0.386816  0.231618  0.805428
c  0.000260  0.533055 -1.203004  1.327866
d  1.163298  0.052400  2.095201  0.877059
e  0.330758 -1.012746  1.311625 -1.428448

In [13]:
print(df)

          w         x         y         z
a -0.324626  0.346383  0.482216  0.693656
b  1.216777  0.386816  0.231618  0.805428
c  0.000260  0.533055 -1.203004  1.327866
d  1.163298  0.052400  2.095201  0.877059
e  0.330758 -1.012746  1.311625 -1.428448

In [14]:
df['w']

a   -0.324626
b    1.216777
c    0.000260
d    1.163298
e    0.330758
Name: w, dtype: float64

In [19]:
df[['w','z']]

          w         z
a -0.324626  0.693656
b  1.216777  0.805428
c  0.000260  1.327866
d  1.163298  0.877059
e  0.330758 -1.428448

In [20]:
df['new'] = df['w']+df['y']

In [21]:
df

          w         x         y         z       new
a -0.324626  0.346383  0.482216  0.693656  0.157590
b  1.216777  0.386816  0.231618  0.805428  1.448395
c  0.000260  0.533055 -1.203004  1.327866 -1.202743
d  1.163298  0.052400  2.095201  0.877059  3.258499
e  0.330758 -1.012746  1.311625 -1.428448  1.642383

In [22]:
df.drop('new',axis=1)

          w         x         y         z
a -0.324626  0.346383  0.482216  0.693656
b  1.216777  0.386816  0.231618  0.805428
c  0.000260  0.533055 -1.203004  1.327866
d  1.163298  0.052400  2.095201  0.877059
e  0.330758 -1.012746  1.311625 -1.428448

In [23]:
df

          w         x         y         z       new
a -0.324626  0.346383  0.482216  0.693656  0.157590
b  1.216777  0.386816  0.231618  0.805428  1.448395
c  0.000260  0.533055 -1.203004  1.327866 -1.202743
d  1.163298  0.052400  2.095201  0.877059  3.258499
e  0.330758 -1.012746  1.311625 -1.428448  1.642383

In [24]:
df.drop('new',axis=1,inplace = True)

In [25]:
df

          w         x         y         z
a -0.324626  0.346383  0.482216  0.693656
b  1.216777  0.386816  0.231618  0.805428
c  0.000260  0.533055 -1.203004  1.327866
d  1.163298  0.052400  2.095201  0.877059
e  0.330758 -1.012746  1.311625 -1.428448

In [26]:
df.drop('e',axis=0)

          w         x         y         z
a -0.324626  0.346383  0.482216  0.693656
b  1.216777  0.386816  0.231618  0.805428
c  0.000260  0.533055 -1.203004  1.327866
d  1.163298  0.052400  2.095201  0.877059

In [28]:
df.loc['a']

w   -0.324626
x    0.346383
y    0.482216
z    0.693656
Name: a, dtype: float64

In [31]:
df.iloc[0]

w   -0.324626
x    0.346383
y    0.482216
z    0.693656
Name: a, dtype: float64

In [32]:
df['w']['a']

-0.32462561437775067

In [33]:
df.loc['a']['w']

-0.32462561437775067

In [34]:
df.iloc[0]['w']

-0.32462561437775067

In [35]:
df>0

       w      x      y      z
a  False   True   True   True
b   True   True   True   True
c   True   True  False   True
d   True   True   True   True
e   True  False   True  False

In [36]:
df<0

       w      x      y      z
a   True  False  False  False
b  False  False  False  False
c  False  False   True  False
d  False  False  False  False
e  False   True  False   True

In [37]:
df>=0

       w      x      y      z
a  False   True   True   True
b   True   True   True   True
c   True   True  False   True
d   True   True   True   True
e   True  False   True  False

In [39]:
(df['w']>0)

a    False
b     True
c     True
d     True
e     True
Name: w, dtype: bool

In [41]:
(df['w']>0).sum()

4

In [42]:
df[df['x']>0]

          w         x         y         z
a -0.324626  0.346383  0.482216  0.693656
b  1.216777  0.386816  0.231618  0.805428
c  0.000260  0.533055 -1.203004  1.327866
d  1.163298  0.052400  2.095201  0.877059

In [50]:
sol = df[df['x']>0]
mycell = ['w','z']
sol[mycell]

          w         z
a -0.324626  0.693656
b  1.216777  0.805428
c  0.000260  1.327866
d  1.163298  0.877059

In [52]:
df['states'] = 'KA KE TN AP TE'.split()

In [53]:
df

          w         x         y         z states
a -0.324626  0.346383  0.482216  0.693656     KA
b  1.216777  0.386816  0.231618  0.805428     KE
c  0.000260  0.533055 -1.203004  1.327866     TN
d  1.163298  0.052400  2.095201  0.877059     AP
e  0.330758 -1.012746  1.311625 -1.428448     TE

In [54]:
df.set_index('states')

               w         x         y         z
states
KA     -0.324626  0.346383  0.482216  0.693656
KE      1.216777  0.386816  0.231618  0.805428
TN      0.000260  0.533055 -1.203004  1.327866
AP      1.163298  0.052400  2.095201  0.877059
TE      0.330758 -1.012746  1.311625 -1.428448

In [55]:
df

          w         x         y         z states
a -0.324626  0.346383  0.482216  0.693656     KA
b  1.216777  0.386816  0.231618  0.805428     KE
c  0.000260  0.533055 -1.203004  1.327866     TN
d  1.163298  0.052400  2.095201  0.877059     AP
e  0.330758 -1.012746  1.311625 -1.428448     TE

In [56]:
df.set_index('states',inplace =True)

In [57]:
df

               w         x         y         z
states
KA     -0.324626  0.346383  0.482216  0.693656
KE      1.216777  0.386816  0.231618  0.805428
TN      0.000260  0.533055 -1.203004  1.327866
AP      1.163298  0.052400  2.095201  0.877059
TE      0.330758 -1.012746  1.311625 -1.428448

In [68]:
outside = ['g1','g1','g1','g2','g2']
inside = [1,2,3,4,5]
matrix = list(zip(outside,inside))

In [69]:
matrix

[('g1', 1), ('g1', 2), ('g1', 3), ('g2', 4), ('g2', 5)]

In [70]:
matrix = pd.MultiIndex.from_tuples(matrix)

In [71]:
matrix

MultiIndex([('g1', 1),
            ('g1', 2),
            ('g1', 3),
            ('g2', 4),
            ('g2', 5)],
           )

In [74]:
df = pd.DataFrame(randn(5,4),index= matrix,columns =['a','b','c','d'])

In [75]:
df

             a         b         c         d
g1 1 -0.070782 -0.611522  0.194547  1.025839
   2  0.327139  0.586525 -1.196564  2.035472
   3  0.888067  0.278761  1.037051  0.970365
g2 4  0.527524  1.028577 -0.059032  0.500809
   5  0.621186  0.491910  0.706283  0.105754

In [76]:
df.loc['g1']

          a         b         c         d
1 -0.070782 -0.611522  0.194547  1.025839
2  0.327139  0.586525 -1.196564  2.035472
3  0.888067  0.278761  1.037051  0.970365

In [77]:
df.loc['g1'].loc[1]['a']

-0.07078199872379547

In [80]:
df.index.names = ['group','name']

In [81]:
df

                   a         b         c         d
group name
g1    1    -0.070782 -0.611522  0.194547  1.025839
      2     0.327139  0.586525 -1.196564  2.035472
      3     0.888067  0.278761  1.037051  0.970365
g2    4     0.527524  1.028577 -0.059032  0.500809
      5     0.621186  0.491910  0.706283  0.105754

In [84]:
df

                   a         b         c         d
group name
g1    1    -0.070782 -0.611522  0.194547  1.025839
      2     0.327139  0.586525 -1.196564  2.035472
      3     0.888067  0.278761  1.037051  0.970365
g2    4     0.527524  1.028577 -0.059032  0.500809
      5     0.621186  0.491910  0.706283  0.105754

In [85]:
df.xs('g1')

             a         b         c         d
name
1    -0.070782 -0.611522  0.194547  1.025839
2     0.327139  0.586525 -1.196564  2.035472
3     0.888067  0.278761  1.037051  0.970365

In [86]:
df.xs(1,level='name')

              a         b         c         d
group
g1    -0.070782 -0.611522  0.194547  1.025839

In [88]:
df.xs(2,level='name')

              a         b         c         d
group
g1     0.327139  0.586525 -1.196564  2.035472